name: "VGG_ILSVRC_16_layers"


input: "input_sentence"
input_shape {
  dim: 1
  dim: 1
}

layer {
  name: "embedding"
  type: "Embed"
  bottom: "input_sentence"
  top: "embedded_sentence"
  propagate_down: 0
  param {
    lr_mult: 1
  }
  embed_param {
    bias_term: false
    input_dim: 10001
    num_output: 1000
    weight_filler {
      type: "uniform"
      min: -0.08
      max: 0.08
    }
  }
}


