name: "VGG_ILSVRC_16_layers"
input: "image_features"
input_shape {
  dim: 1
  dim: 512
}

input: "input_features"
input_shape {
  dim: 1
  dim: 1
  dim: 512
}
input: "cont_sentence"
input_shape {
  dim: 1
  dim: 1
}
layer {
  name: "lstm1"
  type: "LSTM"
  bottom: "input_features"
  bottom: "cont_sentence"
  bottom: "image_features"
  top: "lstm1"
  recurrent_param {
    num_output: 512
  }
}

 


layer {
  name: "predict"
  type: "InnerProduct"
  bottom: "lstm1"
  top: "predict"
  inner_product_param {
    num_output: 10001
    axis: 2
  }
}

layer {
	name: "probs"
	type: "Softmax"
	bottom: "predict"
	top: "probs"
	softmax_param {
	  axis: 2
	}
}
