name: "VGG_ILSVRC_16_layers"
input: "image_features"
input_shape {
  dim: 1
  dim: 1000
}

input: "offset_features"
input_shape {
  dim: 1
  dim: 1
  dim: 1000
}

input: "input_features"
input_shape {
  dim: 1
  dim: 1
  dim: 1000
}
input: "cont_sentence"
input_shape {
  dim: 1
  dim: 1
}
layer {
  name: "image_concat_embedded"
  type: "Concat"
  bottom: "input_features"
  bottom: "offset_features"
  top: "image_concat_embedded"
  concat_param {
    axis: 2
  }
}
layer {
  name: "lstm1"
  type: "LSTM"
  bottom: "image_concat_embedded"
  bottom: "cont_sentence"
  top: "lstm1"
  recurrent_param {
    num_output: 1000
  }
}

layer {
  name: "lstm2"
  type: "LSTM"
  bottom: "input_features"
  bottom: "cont_sentence"
  bottom: "image_features"
  top: "lstm2"
  recurrent_param {
    num_output: 1000
  }
}


layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "lstm2"
  top: "bbox_pred"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4
    axis: 2
  }
}
layer {
  name: "predict"
  type: "InnerProduct"
  bottom: "lstm1"
  top: "predict"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10001
    axis: 2
  }
}

layer {
	name: "probs"
	type: "Softmax"
	bottom: "predict"
	top: "probs"
	softmax_param {
	  axis: 2
	}
}
