name: "VGG_ILSVRC_16_layers"
input: "image_features"
input_shape {
  dim: 1
  dim: 1
  dim: 1000
}

input: "input_features"
input_shape {
  dim: 1
  dim: 1
  dim: 1000
}
input: "cont_sentence"
input_shape {
  dim: 1
  dim: 1
}
layer {
  name: "lstm1"
  type: "LSTM"
  bottom: "input_features"
  bottom: "cont_sentence"
  top: "lstm1"
  propagate_down: 1
  propagate_down: 0
  recurrent_param {
    num_output: 1000
    weight_filler {
      type: "uniform"
      min: -0.08
      max: 0.08
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "lstm1"
  top: "bbox_pred"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "uniform"
      min: -0.01
      max: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    axis: 2
  }
} 


layer {
  name: "predict"
  type: "InnerProduct"
  bottom: "lstm1"
  top: "predict"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10001
    weight_filler {
      type: "uniform"
      min: -0.08
      max: 0.08
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    axis: 2
  }
}

layer {
	name: "probs"
	type: "Softmax"
	bottom: "predict"
	top: "probs"
	softmax_param {
	  axis: 2
	}
}
