name: "VGG_ILSVRC_16_layers"
input: "input_features"
input_shape {
  dim: 1
  dim: 1
  dim: 512
}
input: "global_features"
input_shape {
  dim: 1
  dim: 1
  dim: 512
}
input: "cont_sentence"
input_shape {
  dim: 1
  dim: 1
}
layer {
  name: "lstm1"
  type: "LSTM"
  bottom: "input_features"
  bottom: "cont_sentence"
  top: "lstm1"
  propagate_down: 1
  propagate_down: 0
  recurrent_param {
    num_output: 512
  }
}
layer {
  name: "lstm3"
  type: "LSTM"
  bottom: "global_features"
  bottom: "cont_sentence"
  top: "lstm3"
  propagate_down: 1
  propagate_down: 0
  recurrent_param {
    num_output: 512
  }
}
layer {
  name: "lstm2"
  type: "LSTM"
  bottom: "input_features"
  bottom: "cont_sentence"
  top: "lstm2"
  propagate_down: 1
  propagate_down: 0
  recurrent_param {
    num_output: 512
  }
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "lstm2"
  top: "bbox_pred"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4
    axis: 2
  }
} 

layer{
  name: "lstm_global_fusion"
  type: "Eltwise"
  bottom: "lstm1"
  bottom: "lstm3"
  top: "lstm_global_fusion"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "predict"
  type: "InnerProduct"
  bottom: "lstm_global_fusion"
  top: "predict"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10001
    axis: 2
  }
}

layer {
	name: "probs"
	type: "Softmax"
	bottom: "predict"
	top: "probs"
	softmax_param {
	  axis: 2
	}
}
